> ## Упражнение 04 : Обогащение и трансформации

## Разрешенные функции : импортируйте pandas как pd

In [1]:
import pandas as pd
import numpy as np

## прочитайте файл JSON, который вы сохранили в ex02

### один из столбцов имеет тип float, поэтому давайте определим его формат в pandas с помощью pd.options.display.float_format: числа с плавающей точкой должны отображаться с двумя десятичными знаками
### в модели отсутствуют значения, ничего с ними не делайте

In [2]:
df=pd.read_json('../../datasets/auto.json',orient='records')
df

        CarNumber  Refund         Fines        Make    Model
0    Y163O8161RUS       2   3200.000000        Ford    Focus
1     E432XX77RUS       1   6500.000000      Toyota    Camry
2     7184TT36RUS       1   2100.000000        Ford    Focus
3    X582HE161RUS       2   2000.000000        Ford    Focus
4    E34877152RUS       2   6100.000000        Ford    Focus
..            ...     ...           ...         ...      ...
720  7065C8197RUS       2  11400.000000  Volkswagen   Passat
721  Y163O8161RUS       2   1600.000000        Ford    Focus
722  M0309X197RUS       1  22300.000000        Ford    Focus
723  O673E8197RUS       2    600.000000        Ford    Focus
724  H419XE197RUS       2   8594.586466      Toyota  Corolla

[725 rows x 5 columns]

In [3]:
pd.options.display.float_format = '{:.2f}'.format
df

        CarNumber  Refund    Fines        Make    Model
0    Y163O8161RUS       2  3200.00        Ford    Focus
1     E432XX77RUS       1  6500.00      Toyota    Camry
2     7184TT36RUS       1  2100.00        Ford    Focus
3    X582HE161RUS       2  2000.00        Ford    Focus
4    E34877152RUS       2  6100.00        Ford    Focus
..            ...     ...      ...         ...      ...
720  7065C8197RUS       2 11400.00  Volkswagen   Passat
721  Y163O8161RUS       2  1600.00        Ford    Focus
722  M0309X197RUS       1 22300.00        Ford    Focus
723  O673E8197RUS       2   600.00        Ford    Focus
724  H419XE197RUS       2  8594.59      Toyota  Corolla

[725 rows x 5 columns]

## обогатите фрейм данных, используя образец из этого фрейма данных

### создайте выборку из 200 новых наблюдений с помощью random_state = 21
### в выборке не должно быть новых комбинаций car number, make и model, поэтому весь набор данных будет согласован по этим параметрам
### нет ограничений на refund и fines, вы можете взять любое значение из этих столбцов наугад и использовать его для любого номера автомобиля
### объедините образец с исходным фреймом данных в новый фрейм данных concat_rows

In [ ]:
sample_df = df.sample(n=200, random_state=21)
sample_df

        CarNumber  Refund    Fines  Make   Model
64   H958HY161RUS       1  1800.00  Ford   Focus
155  9822H8161RUS       1   100.00  Ford   Focus
636  T396KX197RUS       2 10300.00  Ford   Focus
162  T195OK161RUS       2  6700.00  Ford  Mondeo
245   Y7129Y50RUS       2 32000.00  Ford   Focus
..            ...     ...      ...   ...     ...
492  8311XX154RUS       2  4300.00  Ford   Focus
217  704987163RUS       2  8594.59  Ford   Focus
257  92928M178RUS       1   600.00  Ford   Focus
537  K559KC161RUS       1   200.00  Ford   Focus
7    X4128H125RUS       1  8594.59  Ford   Focus

[200 rows x 5 columns]

In [5]:
con_cat_rows = pd.concat([df, sample_df], ignore_index=True)

con_cat_rows

        CarNumber  Refund    Fines    Make  Model
0    Y163O8161RUS       2  3200.00    Ford  Focus
1     E432XX77RUS       1  6500.00  Toyota  Camry
2     7184TT36RUS       1  2100.00    Ford  Focus
3    X582HE161RUS       2  2000.00    Ford  Focus
4    E34877152RUS       2  6100.00    Ford  Focus
..            ...     ...      ...     ...    ...
920   X786CO96RUS       1  8594.59    Ford  Focus
921  9764HY161RUS       1   800.00    Ford  Focus
922  H906YK197RUS       1 12000.00    Ford  Focus
923  K2797K154RUS       1  8594.59    Ford  Focus
924  9939KK197RUS       1  1600.00    Ford  Focus

[925 rows x 5 columns]

## обогатите фрейм данных concat_rows новым столбцом с сгенерированными данными

### создайте серию с именем Year, используя случайные целые числа от 1980 до 2019
### используйте np.random.seed(21) перед созданием лет
### объедините серию с фреймом данных и назовите ее fines

In [6]:
np.random.seed(21)

con_cat_rows['Year'] = [np.random.randint(1980, 2019) for i in range(len(con_cat_rows))]

con_cat_rows

        CarNumber  Refund    Fines    Make  Model  Year
0    Y163O8161RUS       2  3200.00    Ford  Focus  1989
1     E432XX77RUS       1  6500.00  Toyota  Camry  1995
2     7184TT36RUS       1  2100.00    Ford  Focus  1984
3    X582HE161RUS       2  2000.00    Ford  Focus  2015
4    E34877152RUS       2  6100.00    Ford  Focus  2014
..            ...     ...      ...     ...    ...   ...
920   X786CO96RUS       1  8594.59    Ford  Focus  1996
921  9764HY161RUS       1   800.00    Ford  Focus  2002
922  H906YK197RUS       1 12000.00    Ford  Focus  1996
923  K2797K154RUS       1  8594.59    Ford  Focus  2012
924  9939KK197RUS       1  1600.00    Ford  Focus  1984

[925 rows x 6 columns]

## обогатите фрейм данных данными из другого фрейма данных

### создайте новый фрейм данных с номерами автомобилей и их владельцами
#### получите самые популярные фамилии (вы можете найти файл surname.json во вложениях) в США
#### создайте новую серию с фамилиями (в них не должно быть специальных символов, таких как запятые, скобки и т. д.) на основе собранных вами данных. Количество должно быть равно числу уникальных номеров автомобилей в выборке (используйте random_state = 21)
#### создайте владельцев фрейма данных с 2 столбцами: CarNumber и SURNAME

In [7]:
surname_df=pd.read_json('../../datasets/surname.json')
surname_df.columns = surname_df.iloc[0]
surname_df.drop(0, inplace=True)
surname_df

0        NAME    COUNT RANK
1       ADAMS   427865   42
2       ALLEN   482607   33
3     ALVAREZ   233983   92
4    ANDERSON   784404   15
5      BAILEY   277845   72
..        ...      ...  ...
96   WILLIAMS  1625252    3
97     WILSON   801882   14
98       WOOD   250715   84
99     WRIGHT   458980   35
100     YOUNG   484447   32

[100 rows x 3 columns]

In [8]:
surname_df.groupby('NAME').size()

NAME
ADAMS       1
ALLEN       1
ALVAREZ     1
ANDERSON    1
BAILEY      1
           ..
WILLIAMS    1
WILSON      1
WOOD        1
WRIGHT      1
YOUNG       1
Length: 100, dtype: int64

In [9]:
car_numbers = con_cat_rows.drop_duplicates('CarNumber')
car_numbers

        CarNumber  Refund    Fines        Make    Model  Year
0    Y163O8161RUS       2  3200.00        Ford    Focus  1989
1     E432XX77RUS       1  6500.00      Toyota    Camry  1995
2     7184TT36RUS       1  2100.00        Ford    Focus  1984
3    X582HE161RUS       2  2000.00        Ford    Focus  2015
4    E34877152RUS       2  6100.00        Ford    Focus  2014
..            ...     ...      ...         ...      ...   ...
709  7367C8197RUS       1  6000.00        Ford    Focus  2010
711  9398MM199RUS       1   300.00  Volkswagen   Passat  2000
717  O136HO197RUS       2  7800.00      Toyota  Corolla  2012
722  M0309X197RUS       1 22300.00        Ford    Focus  2005
723  O673E8197RUS       2   600.00        Ford    Focus  1987

[531 rows x 6 columns]

In [10]:
surname_df = surname_df.sample(n=len(car_numbers), replace=True, random_state=21)

owners = pd.DataFrame({'CarNumber': car_numbers['CarNumber'].values, 'SURNAME': surname_df['NAME'].values})

owners

        CarNumber     SURNAME
0    Y163O8161RUS  RICHARDSON
1     E432XX77RUS        ROSS
2     7184TT36RUS      MORGAN
3    X582HE161RUS      BAILEY
4    E34877152RUS       LOPEZ
..            ...         ...
526  7367C8197RUS    CAMPBELL
527  9398MM199RUS        HALL
528  O136HO197RUS       BAKER
529  M0309X197RUS        DIAZ
530  O673E8197RUS      MORGAN

[531 rows x 2 columns]

### добавьте ещё 5 наблюдений в таблицу штрафов (придумайте свои собственные обозначения для номеров автомобилей и т. д.)

In [11]:
random_index = np.random.randint(0, len(con_cat_rows))
con_cat_rows.iloc[random_index].tolist()

['7089H8163RUS', 2, 4400.0, 'Toyota', 'Corolla', 1995]

In [12]:
newDf=[
    ['3182CD254RUS',1,6000.0,'Toyota','Corolla',2002],
    ['AU345R125RUS',2,9994.54,'Ford','Focus',2016],
    ['O728AM164RUS',2,3500.0,'Volkswagen','Touareg',1991],
    ['P885OH198RUS',1,1000.0,'Volkswagen','Golf',2012],
    ['V2626R123RUS',1,3285.45,'Volkswagen','Touareg',2010],
]

In [13]:
new_df=pd.DataFrame(newDf,columns=con_cat_rows.columns)
new_df

      CarNumber  Refund   Fines        Make    Model  Year
0  3182CD254RUS       1 6000.00      Toyota  Corolla  2002
1  AU345R125RUS       2 9994.54        Ford    Focus  2016
2  O728AM164RUS       2 3500.00  Volkswagen  Touareg  1991
3  P885OH198RUS       1 1000.00  Volkswagen     Golf  2012
4  V2626R123RUS       1 3285.45  Volkswagen  Touareg  2010

In [14]:
fines=pd.concat([new_df,con_cat_rows],ignore_index=True)
fines

        CarNumber  Refund    Fines        Make    Model  Year
0    3182CD254RUS       1  6000.00      Toyota  Corolla  2002
1    AU345R125RUS       2  9994.54        Ford    Focus  2016
2    O728AM164RUS       2  3500.00  Volkswagen  Touareg  1991
3    P885OH198RUS       1  1000.00  Volkswagen     Golf  2012
4    V2626R123RUS       1  3285.45  Volkswagen  Touareg  2010
..            ...     ...      ...         ...      ...   ...
925   X786CO96RUS       1  8594.59        Ford    Focus  1996
926  9764HY161RUS       1   800.00        Ford    Focus  2002
927  H906YK197RUS       1 12000.00        Ford    Focus  1996
928  K2797K154RUS       1  8594.59        Ford    Focus  2012
929  9939KK197RUS       1  1600.00        Ford    Focus  1984

[930 rows x 6 columns]

In [15]:
owners.drop(owners.tail(20).index, inplace=True)
owners

        CarNumber     SURNAME
0    Y163O8161RUS  RICHARDSON
1     E432XX77RUS        ROSS
2     7184TT36RUS      MORGAN
3    X582HE161RUS      BAILEY
4    E34877152RUS       LOPEZ
..            ...         ...
506  H259HY161RUS   HERNANDEZ
507  K889HY161RUS       BAKER
508  O421OT161RUS      MARTIN
509  7360C8197RUS      WRIGHT
510  E29677161RUS        HILL

[511 rows x 2 columns]

In [16]:
new_own_df=[
    ['U415X928RUS','Castilla'],
    ['I17BB7193RUS','Richerd'],
    ['R347T819ARUS','Anna']]
new_o_df=pd.DataFrame(new_own_df,columns=owners.columns)
new_o_df

      CarNumber   SURNAME
0   U415X928RUS  Castilla
1  I17BB7193RUS   Richerd
2  R347T819ARUS      Anna

In [17]:
owners=pd.concat([new_o_df,owners],ignore_index=True)
owners

        CarNumber     SURNAME
0     U415X928RUS    Castilla
1    I17BB7193RUS     Richerd
2    R347T819ARUS        Anna
3    Y163O8161RUS  RICHARDSON
4     E432XX77RUS        ROSS
..            ...         ...
509  H259HY161RUS   HERNANDEZ
510  K889HY161RUS       BAKER
511  O421OT161RUS      MARTIN
512  7360C8197RUS      WRIGHT
513  E29677161RUS        HILL

[514 rows x 2 columns]

In [18]:
inner_df = pd.merge(left=fines, right=owners, on='CarNumber', how='inner')
inner_df

        CarNumber  Refund    Fines    Make    Model  Year     SURNAME
0    Y163O8161RUS       2  3200.00    Ford    Focus  1989  RICHARDSON
1    Y163O8161RUS       2  1600.00    Ford    Focus  2018  RICHARDSON
2     E432XX77RUS       1  6500.00  Toyota    Camry  1995        ROSS
3     E432XX77RUS       2 13000.00  Toyota    Camry  2004        ROSS
4     7184TT36RUS       1  2100.00    Ford    Focus  1984      MORGAN
..            ...     ...      ...     ...      ...   ...         ...
888  O421OT161RUS       1  1200.00   Skoda  Octavia  1987      MARTIN
889  O421OT161RUS       1  1200.00   Skoda  Octavia  1992      MARTIN
890  7360C8197RUS       2  9600.00    Ford    Focus  1989      WRIGHT
891  7360C8197RUS       2  9600.00    Ford    Focus  1999      WRIGHT
892  E29677161RUS       2  6000.00    Ford    Focus  2010        HILL

[893 rows x 7 columns]

In [19]:
outer_df = pd.merge(left=fines, right=owners, on='CarNumber', how='outer')
outer_df

        CarNumber  Refund    Fines        Make    Model    Year   SURNAME
0    3182CD254RUS    1.00  6000.00      Toyota  Corolla 2002.00       NaN
1    AU345R125RUS    2.00  9994.54        Ford    Focus 2016.00       NaN
2    O728AM164RUS    2.00  3500.00  Volkswagen  Touareg 1991.00       NaN
3    P885OH198RUS    1.00  1000.00  Volkswagen     Golf 2012.00       NaN
4    V2626R123RUS    1.00  3285.45  Volkswagen  Touareg 2010.00       NaN
..            ...     ...      ...         ...      ...     ...       ...
928  M0309X197RUS    1.00 22300.00        Ford    Focus 2005.00       NaN
929  O673E8197RUS    2.00   600.00        Ford    Focus 1987.00       NaN
930   U415X928RUS     NaN      NaN         NaN      NaN     NaN  Castilla
931  I17BB7193RUS     NaN      NaN         NaN      NaN     NaN   Richerd
932  R347T819ARUS     NaN      NaN         NaN      NaN     NaN      Anna

[933 rows x 7 columns]

In [20]:
left_df = pd.merge(left=fines, right=owners, on='CarNumber', how='left')
left_df

        CarNumber  Refund    Fines        Make    Model  Year    SURNAME
0    3182CD254RUS       1  6000.00      Toyota  Corolla  2002        NaN
1    AU345R125RUS       2  9994.54        Ford    Focus  2016        NaN
2    O728AM164RUS       2  3500.00  Volkswagen  Touareg  1991        NaN
3    P885OH198RUS       1  1000.00  Volkswagen     Golf  2012        NaN
4    V2626R123RUS       1  3285.45  Volkswagen  Touareg  2010        NaN
..            ...     ...      ...         ...      ...   ...        ...
925   X786CO96RUS       1  8594.59        Ford    Focus  1996      SMITH
926  9764HY161RUS       1   800.00        Ford    Focus  2002  GUTIERREZ
927  H906YK197RUS       1 12000.00        Ford    Focus  1996      BROWN
928  K2797K154RUS       1  8594.59        Ford    Focus  2012      GOMEZ
929  9939KK197RUS       1  1600.00        Ford    Focus  1984     ROGERS

[930 rows x 7 columns]

In [21]:
right_df = pd.merge(left=fines, right=owners, on='CarNumber', how='right')
right_df

        CarNumber  Refund   Fines   Make    Model    Year     SURNAME
0     U415X928RUS     NaN     NaN    NaN      NaN     NaN    Castilla
1    I17BB7193RUS     NaN     NaN    NaN      NaN     NaN     Richerd
2    R347T819ARUS     NaN     NaN    NaN      NaN     NaN        Anna
3    Y163O8161RUS    2.00 3200.00   Ford    Focus 1989.00  RICHARDSON
4    Y163O8161RUS    2.00 1600.00   Ford    Focus 2018.00  RICHARDSON
..            ...     ...     ...    ...      ...     ...         ...
891  O421OT161RUS    1.00 1200.00  Skoda  Octavia 1987.00      MARTIN
892  O421OT161RUS    1.00 1200.00  Skoda  Octavia 1992.00      MARTIN
893  7360C8197RUS    2.00 9600.00   Ford    Focus 1989.00      WRIGHT
894  7360C8197RUS    2.00 9600.00   Ford    Focus 1999.00      WRIGHT
895  E29677161RUS    2.00 6000.00   Ford    Focus 2010.00        HILL

[896 rows x 7 columns]

## Cоздайте сводную таблицу из фрейма данных fines , она должна выглядеть так (значения — это суммы штрафов), но со всеми годами (у вас значения могут отличаться):

In [22]:
pivot_table=pd.pivot_table(data=fines, columns='Year', values='Fines', index=['Make', 'Model'], aggfunc='sum')
pivot_table

Year                    1980      1981     1982      1983     1984      1985  \
Make       Model
Audi                     NaN       NaN      NaN       NaN      NaN       NaN
BMW                      NaN       NaN      NaN       NaN      NaN   3000.00
Ford       Focus   165989.17 225189.17 98983.76 157289.17 55689.17  95883.76
           Mondeo        NaN       NaN      NaN       NaN      NaN       NaN
Skoda      Octavia   4400.00  83000.00  8594.59   4800.00      NaN 156700.00
Toyota     Camry     8594.59   4400.00 22600.00   7900.00      NaN       NaN
           Corolla       NaN       NaN      NaN       NaN      NaN       NaN
Volkswagen               NaN       NaN      NaN   7900.00      NaN       NaN
           Golf     18400.00   9300.00      NaN  24000.00  5800.00   3800.00
           Jetta         NaN       NaN  4000.00       NaN  1500.00       NaN
           Passat        NaN       NaN      NaN       NaN  2500.00  31700.00
           Touareg       NaN       NaN      NaN       NaN      NaN       NaN
Volvo                    NaN       NaN      NaN       NaN      NaN       NaN

Year                    1986      1987     1988      1989  ...      2009  \
Make       Model                                           ...
Audi                     NaN       NaN      NaN       NaN  ...       NaN
BMW                      NaN       NaN      NaN       NaN  ...       NaN
Ford       Focus   202178.35 292394.59 84389.17 192794.59  ... 153400.00
           Mondeo        NaN       NaN      NaN       NaN  ...       NaN
Skoda      Octavia       NaN   1200.00  1100.00   1600.00  ...  17094.59
Toyota     Camry         NaN       NaN      NaN  22400.00  ...       NaN
           Corolla       NaN   3200.00  7600.00       NaN  ...  16594.59
Volkswagen               NaN       NaN      NaN       NaN  ...       NaN
           Golf      8594.59   5800.00      NaN       NaN  ...    500.00
           Jetta         NaN       NaN      NaN       NaN  ...       NaN
           Passat    8594.59   1600.00      NaN  16000.00  ...       NaN
           Touareg       NaN       NaN      NaN       NaN  ...       NaN
Volvo                    NaN       NaN      NaN       NaN  ...       NaN

Year                   2010      2011      2012      2013      2014      2015  \
Make       Model
Audi                    NaN       NaN       NaN       NaN       NaN       NaN
BMW                     NaN       NaN       NaN       NaN       NaN       NaN
Ford       Focus   99489.17 184389.17 126694.59 242894.59 163794.59 155289.17
           Mondeo       NaN       NaN       NaN       NaN       NaN       NaN
Skoda      Octavia  8400.00       NaN   5400.00  11600.00  11594.59       NaN
Toyota     Camry    7200.00  19800.00       NaN       NaN       NaN       NaN
           Corolla      NaN   4000.00  23800.00       NaN       NaN   9600.00
Volkswagen          7400.00       NaN       NaN       NaN       NaN       NaN
           Golf         NaN       NaN   1300.00  20800.00       NaN  18400.00
           Jetta    9000.00       NaN       NaN   9000.00       NaN       NaN
           Passat  10000.00   9500.00   3000.00  15000.00       NaN       NaN
           Touareg  3285.45       NaN   6300.00   8594.59       NaN   1300.00
Volvo                   NaN   6800.00       NaN       NaN       NaN       NaN

Year                    2016      2017      2018
Make       Model
Audi                     NaN       NaN       NaN
BMW                  6500.00       NaN       NaN
Ford       Focus   189383.71 125094.59 142883.76
           Mondeo        NaN       NaN       NaN
Skoda      Octavia  46394.59    500.00   8600.00
Toyota     Camry     8594.59   1000.00       NaN
           Corolla       NaN       NaN  34300.00
Volkswagen               NaN       NaN       NaN
           Golf       300.00 175300.00   1000.00
           Jetta         NaN       NaN       NaN
           Passat        NaN    600.00       NaN
           Touareg       NaN       NaN       NaN
Volvo                    NaN  10200.00       NaN

[13 rows x 39 columns]

In [23]:
fines.to_csv('../../datasets/fines.csv', index=False)
owners.to_csv('../../datasets/owners.csv', index=False)